app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "dfgsg"], ["body", "sdfgsdf"], ["created_at", "2018-10-06 03:13:38.786433"], ["updated_at", "2018-10-06 03:13:38.786433"]]
---
  def create
    # render plain: params[:post].inspect
    @post = Post.new(post_params)

    if (@post.save)

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "posts" SET "body" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["body", "Post 2 info"], ["updated_at", "2018-10-06 04:50:07.752158"], ["id", 1]]
---
  def update
      @post = Post.find(params[:id])

      if (@post.update(post_params))